import {useState} from "react";
import Link from "next/link";
import Button from "../../comps/Button";
import {useDispatch} from "react-redux";
import {setPolicy} from "../../storage/reducers/signReducer";
import {useRouter} from "next/router";

export default function TermsOfUse() {
    const [read, setRead] = useState(false)
    const router = useRouter()
    const dispatch = useDispatch()
    return (
        <div className="h-full bg-gradient-to-t from-grad_from to-grad_to ">
            <div className={'font-[Inter] text-gray-200 items-center justify-center w-full'}>
                <div className='container min-h-screen mx-auto pt-6 pb-4 '>
                    <div className="bg-gray-800 pl-4 pr-4 rounded-3xl ">
                        <div className="text-center pt-2">
                            <h2 className={'text-3xl mt-4 font-semi-bold'}>ДОГОВІР<br/>
                                публічної оферти про надання інформаційних  послуг<br/>
                                з використання  програмної	продукції
                            </h2>
                        </div>

            <h2 className={'text-2xl mt-4'}>ФОП Коструба Тарас Миколайович (надалі «Виконавець»), який діє на підставі виписки з ЄДР  з однієї сторони, цим документом пропонує необмеженому колу фізичних осіб, надалі - Клієнт або	Замовник, з іншої Сторони (надалі	разом	- Сторони) – акцептувати цю Публічну оферту (укласти договір про надання  інформаційних  послуг з використання  програмної продукції ISP Network LTD).
                Оферта є публічною	і, згідно ст. ст. 633, 641 ЦК України, її умови однакові для всіх Клієнтів або Замовників. Беззастережне прийняття всіх умов даної Публічної оферти без будь-яких винятків і/або обмежень вважається акцептом даної Публічної оферти (далі Договору) Виконавцем і Замовником, а сам Договір автоматично вважається укладеним.
            </h2>

            <h3 className={'text-xl mt-2 font-medium'}>Розділ І. Терміни</h3>
            <p className={'text-xl'}>1.1. Публічна	оферта – пропозиція	 Виконавця (викладена на веб-сайті Виконавця), адресована необмеженому колу фізичних осіб відповідно до статті 641  Цивільного кодексу України укласти Договір про	 надання послуг на визначених умовах Договору</p>
            <p className={'text-xl'}>1.2. Договір – правочин, укладений у формі договору приєднання відповідно до ст. 634 Цивільного кодексу України	про надання послуг, умови якого встановлені Виконавцем, і який	може бути укладено лише шляхом	приєднання Замовника до запропонованого Договору в цілому.</p>
            <p className={'text-xl'}>1.3. Сайт Виконавця	– веб-сторінка в мережі Інтернет, за адресою https://maximum-ott.com , яка є основним джерелом інформування Замовника і/або може бути використаний Замовником	для одержання послуг Виконавця та подальшого	електронного	документообігу документів в рамках Договору.</p>
            <p className={'text-xl'}>1.4. Мобільний додаток «Rest TV» – програмне забезпечення, призначене для установки	 (завантаження) на смарт-пристрій Замовника, які працюють під управлінням операційних систем iOS та Android, яке надається ISP Network LTD Замовнику у тимчасове користування (впродовж строку дії даного Договору) для одержання послуг Виконавця та подальшого	електронного	документообігу документів в рамках Договору.</p>
            <p className={'text-xl'}>1.5. Замовник	 – дієздатна фізична особа, яка Акцептувала Публічну оферту Виконавця,	викладену у цьому Договорі.</p>
            <p className={'text-xl'}>1.6. Користувач – фізична особа, що установила (завантажила) Мобільний додаток та	зареєстрована на сервері Виконавця за кодом-підтвердженням, який автоматично направляється	у вигляді повідомлення електронної пошти і/обо СМС повідомлення на	зазначені Замовником адресу електронної пошти і/або номер телефону.</p>
            <p className={'text-xl'}>1.7. Акцепт – повне, безумовне та беззастережне прийняття Замовником умов визначених	Офертою без будь-яких виключень, обмежень та	застережень згідно із частиною 2 статті 642 Цивільного кодексу України. Акцепт може	бути здійснений одним з наступних	 способів:
                <br/>- перерахуванням грошових коштів на банківський рахунок Виконавця в якості оплати	або часткової (підписки на щомісячну) оплати за відповідні послуги Виконавця;
                <br/>- розміщенням Замовником Замовлення на послуги Виконавця за допомогою сайту Виконавця</p>
            <p className={'text-xl'}>1.8. Замовник	 повинен ознайомитись з умовами	Публічної оферти та підтвердити свою	згоду з	її умовами при отриманні будь-яких послуг Виконавця, а також	при замовленні будь-яких послуг	через Сайт Виконавця і/або	через Мобільний додаток Виконавця.</p>
            <p className={'text-xl'}>1.9. Авторизований доступ – доступ до послуг Виконавця за умови успішного	 засвідчення	 правомірності	 дистанційного звернення користувача до серверу Виконавця, що здійснюється за	 допомогою автоматично згенерованого сервером Виконавця коду-підтвердження.</p>
            <p className={'text-xl'}>1.10 “Логін” та “Пароль” – індивідуальний набір символів, які  Замовник генерує при заповненні форми реєстрації та дозволяє здійснити реєстрацію на сервері Виконавця.</p>
            <p className={'text-xl'}>1.11. Облікові	дані – дані Користувача (Замовника), які використовуються для його	ідентифікації та надання авторизованого доступу до мобільного додатку та інших програм.</p>
            <p className={'text-xl'}>1.12. Персональні дані – відомості чи сукупність відомостей про фізичну особу, яка ідентифікована або може бути конкретно ідентифікована.</p>
            <p className={'text-xl'}>1.13. Згода суб’єкта персональних даних – добровільне	волевиявлення фізичної особи, яка надає дозвіл на обробку її персональних даних відповідно до мети обробки.</p>
            <p className={'text-xl'}>1.14. Обробка персональних даних – будь-яка дія або сукупність дій, таких як	 збирання, реєстрація, накопичення, зберігання, адаптування, зміна, поновлення, використання і поширення (розповсюдження, реалізація, передача), знеособлення, знищення персональних	 даних,	 у тому	 числі з використанням інформаційних (автоматизованих) систем.</p>
            <p className={'text-xl'}>1.15. Правила надання відповідних Послуг – умови надання Послуг, які обираються Замовником в рамках цього Договору, є його невід’ємною частиною та є єдиним джерелом врегулювання всіх відносин	між Замовником та Виконавцем, що виникають в	процесі надання Послуг. Всі рекламні,	 презентаційні та інші матеріали, що створені та існують з метою інформування про послуги Виконавця, носять лише інформаційно-довідковий характер і не є джерелом врегулювання всіх умов	надання Послуг.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ ІІ. Загальні умови</h3>
            <p className={'text-xl'}>2.1. Цей Договір укладається між Замовником і Виконавцем у формі договору приєднання відповідно до	ст. 634 Цивільного кодексу України та діє до виконання Сторонами своїх обов’язків.</p>
            <p className={'text-xl'}>2.2. Публікація (розміщення) тексту Договору на сайті Виконавця є офіційною пропозицією (Публічною Офертою) Виконавця, що адресована невизначеному колу осіб відповідно до статті 641 Цивільного кодексу України, укласти з ним договір про надання послуг на умовах договору приєднання.</p>
            <p className={'text-xl'}>2.3. У випадку прийняття умов даної Оферти, Замовник погоджується з усіма умовами цього Договору і підтверджує, що йому зрозумілі всі його положення.</p>
            <p className={'text-xl'}>2.4. Ця Оферта є відкритим	і загальнодоступним документом. Чинна версія Договору розміщується за адресою: https://maximum-ott.com і є доступною для ознайомлення до моменту здійснення Замовником акцепту умов Договору.</p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
            <p className={'text-xl'}>2.5. Виконавець має право Змінювати або доповнювати Договір в будь-який момент без попереднього або наступного повідомлення, що оприлюднюється за 10 днів до набрання ними чинності і доводяться до загального відома за допомогою публікації на Сайті. Обов'язок ознайомлення з діючою редакцією Договору покладається на Замовника. Продовження користування мобільним додатком та іншими програмними продуктами Замовником після внесення змін і/або доповнень до Договору означає прийняття і згоду Користувача з такими змінами і/або доповненнями.</p>
            <p className={'text-xl'}>2.6. Продовження використання Замовником мобільного додатку та інших програмних продуктів після набуття чинності змін та/або доповнень до тексту Оферти означає акцепт Замовником оновленого Договору. У разі незгоди Замовника зі змінами та/або доповненнями, внесеними Виконавцем до тексту Оферти, або незгоди з новими тарифами на послугу, Замовник повинен припинити користування мобільним  додатком  іншими програмними продуктами</p>
            <p className={'text-xl'}>2.7. Кожна Сторона гарантує іншій Стороні, що володіє необхідною дієздатністю, а також всіма правами і повноваженнями, необхідними і достатніми для укладання і виконання Договору відповідно до його умов. Замовник також підтверджує, що не існує будь-яких обставин через які можна було б визнати такий договір нікчемним.</p>
            <p className={'text-xl'}>2.8. Цей Договір є публічним в розумінні статті 633 Цивільного кодексу України.</p>
            <p className={'text-xl'}>2.9. Місцем укладення Договору є місто Яворів, Україна.</p>
            <p className={'text-xl'}>2.10. При приєднанні до даної Публічної оферти Замовник надає згоду Виконавцю на використання	та обробку його персональних даних в рамках Закону України «Про захист персональних	даних».</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ III. Порядок укладання Договору</h3>
            <p className={'text-xl'}>3.1. Укладання Договору проводиться через приєднання Замовника до Публічної Оферти шляхом повного і беззастережного прийняття (акцептування) ним умов цього Договору в цілому, без будь-яких умов, вилучень і зауважень.</p>
            <p className={'text-xl'}>3.2. Замовник підтверджує, що до укладення цього Договору він був повністю та належним чином ознайомлений з усіма його положеннями та прийняв їх із власної волі без будь-якого примусу. Підтвердженням ознайомлення з умовами договору та їх прийняття є також встановлення символу у спеціальному полі під словами «Я прочитав(ла) та погоджуюся із умовами Політики конфіденційності та Договору оферти», що з’являється під час заповнення форми для реєстрації.</p>
            <p className={'text-xl'}>3.3. Замовник здійснює акцепт Договору (тобто дає свою пряму та безвідкличну згоду на	дотримання всіх його умов) шляхом сукупного або окремого виконання хоча б однієї з наступних дій:
                <br/> - перерахуванням грошових коштів	 на банківський рахунок Виконавця в якості оплати або часткової (підписки на щомісячну) оплати за відповідні послуги Виконавця;
                <br/> - розміщенням Замовником Замовлення на послуги Виконавця за допомогою	 сайту Виконавця.</p>
            <p className={'text-xl'}>3.4. Фактом укладення (акцептування) Договору є здійснення Замовником дій, визначених у п. 3.3. Розділу 3 цього Договору.</p>
            <p className={'text-xl'}>3.5. Договір, за умови дотримання порядку його акцептування, вважається укладеним в простій письмовій формі, вступає в силу з моменту акцепту і діє протягом усього терміну отримання послуг, або до моменту його розірвання на підставах, визначених умовами Договору та/або нормами чинного законодавства України. Закінчення дії Договору не звільняє сторони від виконання взятих на	себе зобов’язань, визначених умовами цього Договору. </p>
            <p className={'text-xl'}>3.6. Укладання Договору означає, що Замовник: у необхідному для нього обсязі ознайомився з правилами надання послуг; визнає професійну придатність Виконавця і правила здійснення всіх дій, описаних в цьому Договорі та приймає всі умови вказаного Договору без зауважень.</p>
            <p className={'text-xl'}>3.7. Мобільний додаток функціонує за принципом «як є», тобто є таким, яким Замовник його зараз бачить і який є	доступним для Замовника.</p>
            <p className={'text-xl'}>3.8.  Виконавець не несе відповідальності за будь-який несанкціонований доступ або використання мобільного додатку та/або будь-якої інформації про користувачів, що зберігається на Сервері, а також за будь-які помилки, збої, віруси і інші недоліки та порушення в мобільному	 додатку, або/та інших програмних продуктах які можуть бути передані на мобільний додаток або через Додаток третіми особами та їх наслідки у Користувача,  у т.ч. але не виключно; за збитки, упущену вигоду, моральну шкоду, шкоду честі, гідності та ділової репутації.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ IV. Предмет договору, порядок виконання та оплата послуг</h3>
            <p className={'text-xl'}>4.1. Ця Публічна оферта (Договір) визначає особливості надання інформаційних  послуг з використання  програмної продукції ISP Network LTD).</p>
            <p className={'text-xl'}>4.2. Замовник своєчасно та в повному обсязі сплачує вартість наданих йому  послуг, згідно тарифів, встановлених Виконавцем. Вартість послуг зазначається Виконавцем на сайті.</p>
            <p className={'text-xl'}>4.3.	Замовник зобов’язаний внести передоплату за послуги Виконавця.</p>
            <p className={'text-xl'}>4.4.	 Послуги надаються з моменту Акцепту Замовником умов та положень даного Договору та внесення передоплати за послуги.</p>
            <p className={'text-xl'}>4.5.	Місцем надання послуг вважається місце	яке ідентифіковане та вказано Замовником.</p>
            <p className={'text-xl'}>4.6.	У разі Укладення дистанційного Договору зацікавлена особа зобов’язана правдиво, повно та точно ввести дані у форму при реєстрації через зону Замовника, а після перевірки всіх даних створити обліковий запис. Створюючи обліковий запис, Замовник також підтверджує, що ознайомився зі змістом ЗУД та Політикою конфіденційності, які є загальнодоступними на веб-сайті Постачальника sweet.tv та приймає умови у повному обсязі. Замовник несе відповідальність перед Постачальником за будь-які збитки, спричинені наданням неправдивих, неповних або неточних даних під час реєстрації у формі проекту Договору через зону Замовника.</p>
            <p className={'text-xl'}>4.7. Замовник	 сплачує послуги шляхом перерахування грошових коштів за послуги на поточний рахунок Виконавця.</p>
            <p className={'text-xl'}>4.8. Виконавець має право в односторонньому порядку змінювати тарифи на	 послуги. Інформацію про такі зміни Виконавець оприлюднює на інтернет сторінці за адресою: https://maximum-ott.com.</p>
            <p className={'text-xl'}>4.9. У разі відмови Замовником від Замовлення, передоплата Виконавцем Замовнику не повертається.</p>
            <p className={'text-xl'}>4.11. Виконавець не повертає передоплату зроблену Замовником у випадку передбаченому п. 5.3.3. Розділу 5 та п. 8.3. Розділу	8 даного Договору.</p>
            <p className={'text-xl'}>4.12. Надання послуг виконується в наступному порядку:</p>
            <p className={'text-xl'}>4.12.1.	Замовник акцептує даний Договір будь яким способом визначеним п. 1.7. Розділу 1. даного	 Договору  та	 оформляє Замовлення за допомогою сайту https://maximum-ott.com.	і/або мобільного додатку.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ V.  Права та обов’язки сторін</h3>
            <p className={'text-xl'}>5.1. Замовник має право:	</p>
            <p className={'text-xl'}>5.1.1. Отримувати необхідну і достовірну інформацію пов’язану з наданням Виконавцем послуг.</p>
            <p className={'text-xl'}>5.2. Замовник зобов’язується:</p>
            <p className={'text-xl'}>5.2.1. Надавати повну та достовірну інформацію, необхідну для ідентифікації Замовника.</p>
            <p className={'text-xl'}>5.2.2. Повідомити прізвище, ім’я та	по батькові, засіб зв’язку, адресу місця надання послуг, а також іншу додаткову інформацію при її запиті Виконавцем.</p>
            <p className={'text-xl'}>5.2.3. При зверненні до Виконавця за наданням послуг, не порушувати вимог чинного законодавства та прийнятих суспільством норм моралі та моральності, не використовувати результати надання послуг Виконавцем у протиправних цілях, в результаті чого можуть бути порушені права та законні інтереси Виконавця та/або третіх осіб.</p>
            <p className={'text-xl'}>5.2.4. Своєчасно оплачувати послуги Виконавця, в порядку, розмірі і в строки, що визначені Договором.</p>
            <p className={'text-xl'}> 5.2.5.	Надати представникам Виконавця доступ до місця виконання робіт.</p>
            <p className={'text-xl'}>5.2.6. Підготувати та надати	 Виконавцю всі необхідні матеріали для виконання робіт.</p>
            <p className={'text-xl'}>5.2.7.Приймати від Виконавця надані послуги у разі їх відповідності умовам Договору.	 </p>
            <p className={'text-xl'}>5.2.9. Під час користування послугами керуватися довідковою інформацією, що розміщена у відповідному розділі на сайті https://maximum-ott.com.</p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
            <p className={'text-xl'}>5.2.10. У разі виникнення претензій щодо наданих Виконавцем послуг письмово у вільній формі повідомити про це Виконавця протягом 3 (трьох) календарних днів з моменту, коли Замовникові стало відомо про невиконання або неналежне виконання Виконавцем його зобов'язань за цим Договором.</p>
            <p className={'text-xl'}>5.2.11. Унеможливити доступ до мобільного додатку третіх осіб, не передавати облікові дані користувача третім особам.</p>
            <p className={'text-xl'}>5.2.12. Дотримуватися законодавства України, що стосується охорони авторських прав Виконавця.</p>
            <p className={'text-xl'}>5.3. Виконавець має право:</p>
            <p className={'text-xl'}>5.3.1. Залучати для здійснення своїх обов’язків третіх осіб, які мають необхідну кваліфікацію для надання конкретного виду послуги.</p>
            <p className={'text-xl'}> 5.3.2. Перевіряти надану  Замовником інформацію, а також виконання Замовником умов Договору.</p>
            <p className={'text-xl'}>5.3.3. Відмовити Замовнику у наданні послуг у випадках, якщо:
                <br/>а) замовник порушив	 свої зобов’язання щодо оплати послуг;
                <br/>б) замовник використовує результати наданих послуг у протиправних цілях, що шкодить або може зашкодити правам та законним інтересам Виконавця та/або третіх осіб;
                <br/>в) замовник не надав доступ до об’єкту надання послуг (робіт);
                <br/>г) замовник не надав всі необхідні матеріали для виконання робіт;
                <br/>ґ) замовник надав недостовірну або неповну інформацію, або не надав її взагалі;
                <br/>д) замовник знаходиться в стані алкогольного або наркотичного сп’яніння або поведінка Клієнта або інших осіб несе загрозу життю та здоров’ю представнику Виконавця;
                <br/>е) замовник не згоден з умовами даного Договору;
                <br/>є) замовник надав неналежний матеріал для роботи який унеможливлює надання послуг.</p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
            <p className={'text-xl'}>5.3.4. Змінювати або доповнювати Договір в будь-який момент без попереднього або наступного повідомлення, що оприлюднюється за 10 днів до набрання ними чинності і доводяться до загального відома за допомогою публікації на інтернет сторінці https://maximum-ott.com. Обов'язок ознайомлення з діючою редакцією Договору покладається на Замовника. Продовження користування послугами Замовником після внесення змін і/або доповнень до Договору означає прийняття і згоду Користувача з такими змінами і/або доповненнями.</p>
            <p className={'text-xl'}>5.3.5. Блокувати грошові кошти на вказаному Замовником картковому рахунку у розмірі вартості замовлених послуг.</p>
            <p className={'text-xl'}>5.4. Виконавець зобов’язується:</p>
            <p className={'text-xl'}>5.4.1. Забезпечувати Замовнику можливість отримання послуг належної якості.</p>
            <p className={'text-xl'}>5.4.2. Забезпечувати Замовнику можливість отримання інформації з питань надання послуг.	5.4.3. Забезпечувати Замовнику можливість отримання ним послуг.</p>
            <p className={'text-xl'}>5.4.4. У разі неможливості надання послуги з вини Виконавця, невідкладно повідомити Замовника про неможливість та повідомити дату та час надання послуги.</p>
            <p className={'text-xl'}>5.4.5. Дотримуватись вимог Закону	 України «Про захист персональних даних» при обробці персональних	даних Користувачів Системи.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ VI. Інші умови</h3>
            <p className={'text-xl'}>6.1. Порядок врегулювання спорів та застосовне право.</p>
            <p className={'text-xl'}>6.1.1. До відносин сторін, що випливають з прийняття та виконання даного Договору та всіх Додатків до нього, застосовуються чинні норми та положення законодавства України такою	 мірою, якою це не суперечить імперативним нормам права України.</p>
            <p className={'text-xl'}>6.2. Обмеження відповідальності Виконавця.</p>
            <p className={'text-xl'}>6.2.1. Сторони розуміють і визнають, що невідповідність результату надання тієї чи іншої послуги результату, що очікував та бажав отримати Замовник при зверненні за наданням відповідної послуги, саме по собі не є фактом надання такої послуги неналежної якості.</p>
            <p className={'text-xl'}>6.3. Прикінцеві положення.</p>
            <p className={'text-xl'}>6.3.1. Виконавець залишає за собою право в будь-який час в односторонньому порядку вносити зміни до даного Договору.</p>
            <p className={'text-xl'}>6.3.2. Всі зміни до цього Договору публікуються на Сайті Виконавця.</p>
            <p className={'text-xl'}>6.3.3. Всі зміни до даного Договору набувають чинності з моменту їх публікації на Сайті Виконавця.</p>
            <p className={'text-xl'}>6.3.4. Внесені зміни, що набрали чинності, розповсюджуються на всіх Замовників.</p>
            <p className={'text-xl'}>6.3.5.Замовники вважаються повідомленими про внесені до Договору зміни з моменту опублікування цих змін на Сайті Виконавця.</p>
            <p className={'text-xl'}>6.3.6. Всі Додатки до Договору є невід’ємними частинами цього Договору та є обов’язковими для їх виконання та дотримання.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ VII. Відповідальність сторін</h3>
            <p className={'text-xl'}>7.1. Сторони несуть відповідальність за невиконання чи неналежне виконання  зобов&apos;язань за цим Договором відповідно до чинного законодавства України, з урахуванням особливостей, встановлених Договором.</p>
            <p className={'text-xl'}>7.2. Сторона не несе відповідальності за порушення Договору, якщо воно сталося не з її вини (умислу чи необережності). Сторона вважається невинуватою і не несе відповідальності за порушення Договору, якщо вона доведе, що вжила всіх залежних від неї заходів щодо належного виконання цього Договору.</p>
            <p className={'text-xl'}>7.3. Сторони звільняються від відповідальності за невиконання або неналежне виконання зобов’язань за цим Договором у разі виникнення обставин непереборної  сили, які не існували під час укладання Договору та виникли поза волею Сторін. Такими обставинами	 є: стихійні лиха, екстремальні погодні умови, пожежі, епідемії, будь-які військові дії, катастрофи, аварії, страйки, забороняючі акти органів державної влади (у т.ч. числі місцевих та інші форс-мажорні обставини подібного роду.</p>
            <p className={'text-xl'}>7.4. Виконавець не несе відповідальність:
                <br/> за зміст даних користувача, а також за зміст будь-якої інформації, що вноситься іншими користувачами.
                <br/> у разі тимчасової непрацездатності мобільного  додатку та  інших програмних продуктів через такі причини: планові або позапланові технічні чи профілактичні роботи, технічні збої інтернет-провайдерів, комп’ютерних мереж, серверів та засобів, а також протиправні дії третіх осіб або форс-мажорні обставини. При цьому Виконавець бере на себе обов’язок докласти максимум зусиль для відновлення працездатності в найкоротший термін.
                <br/> за  втрату інформації щодо доступу до мобільного додатку що відбулася з вини користувача, а також за будь-які наслідки, що можуть виникнути в результаті цього
                <br/> за жодні наслідки порушення безпеки, зокрема порушення чи псування даних, що відбулися внаслідок доступу третіх осіб до мобільного додатку	та  інших програмних продуктів</p>
            <p className={'text-xl'}>7.5. Виконавець за жодних обставин не несе відповідальності за порушення Користувачами інтелектуальних прав третіх осіб. Користувачам забороняється створювати, завантажувати, розміщувати, копіювати інформацію, матеріали або зображення з порушенням інтелектуальних прав третіх осіб.</p>
            <p className={'text-xl'}>7.6. Винятковими правами на об’єкти права інтелектуальної власності, пов’язані з мобільним додатком	та іншими програмними продуктами, у т.ч. на торговельні марки (знаки для товарів і послуг), на об &apos; єкти авторських прав тощо, включаючи, але не обмежуючись, на програми та сервіси, за допомогою яких Система реалізована володіє  ISP Network LTD.Будь-яке використання програм та сервісів Виконавця, не призводить до передачі Замовнику будь-яких прав інтелектуальної власності на них.</p>

            <h3 className={'text-xl mt-4 font-medium'}>Розділ VIII. Термін дії договору</h3>
            <p className={'text-xl'}>8.1.Дійсний договір Публічної оферти діє з моменту приєднання до нього Замовника.</p>
            <p className={'text-xl'}>8.2.Термін дії договору необмежений.</p>
            <p className={'text-xl'}>8.3. Клієнт має право розірвати дійсний договір при невиконанні його умов Виконавцем або при відсутності необхідності в послугах. Розірванням договору зі сторони Замовника буде припинення оплати послуг Виконавцю.</p>
            <p className={'text-xl'}>8.4. Після розміщення дійсного Договору Публічної оферти на сайті Виконавця всі попередні положення, які вступають з ним в протиріччя, втрачають силу.</p>

            <h3 className={'text-xl font-medium'}>Розділ IX. Заключні положення.</h3>
            <p className={'text-xl'}>9.1. Цей договір регулюється чинним законодавством України.</p>
            <p className={'text-xl'}>9.2. Виконавець може проводити аудіозапис всіх розмов з Замовником без додаткового повідомлення Замовника про це. Дана інформація є конфіденційною.</p>
            <p className={'text-xl'}>9.3. Виконавець зберігає конфіденційність даних та інформації, отриманої від Замовника при укладанні Договору або в ході його виконання і може їх розповсюдити виключно в порядку та випадках прямо передбачених чинним законодавством України.</p>
            <p className={'text-xl'}>9.4. Замовник надає безумовну згоду на зберігання і обробку, в тому числі автоматизовану, будь-якої інформації, що відноситься до персональних даних Замовника з метою, що пов’язана з виконанням даного Договору та наслідків його виконання, або невиконання. Замовник надає Виконавцю свою згоду на обробку всіх його персональних даних без обмеження терміну зберігання та терміну обробки персональних даних.</p>
            <p className={'text-xl'}>9.5. Визнання будь-якого положення або пункту даного Договору чи додатків до нього не	дійсним, не впливає на дійсність решти положень і умов Договору.</p>

                        <div className="flex lg:justify-evenly flex-col lg:flex-row">
                            <div>
                                <h2 className={'text-2xl mt-4'}>Замовник:</h2>
                            </div>

                            <div>
                                <h2 className={'text-2xl mt-4'}>Виконавець:</h2>
                            </div>
                        </div>
                        <div className="flex lg:justify-around">
                            <div>
                                <h2 className={'text-2xl mt-4'}></h2>
                            </div>

                            <div className="pb-8">
                                <h2 className={'text-2xl mt-4'}>ФОП Коструба Тарас Миколайович</h2>
                            </div>
                        </div>

                    </div>
                </div>
            </div>
        </div>
        )
    }