import {useState} from "react";
import Link from "next/link";
import Button from "../../comps/Button";
import {useDispatch} from "react-redux";
import {setPolicy} from "../../storage/reducers/signReducer";
import {useRouter} from "next/router";

export default function TermsOfUse() {
    const [read, setRead] = useState(false)
    const router = useRouter()
    const dispatch = useDispatch()
    return (
        <div className="flex flex-col h-full z-[30] mb-8 ">
            <div className={'z-[20] font-primary text-gray-200 items-center justify-center z-20 px-4 sm:px-16 md:px-20 lg:px-24 xl:px-28 2xl:px-32 w-full'}>
                <div className='z-[30] min-h-screen pt-6 pb-4 '>
                    <div className="z-[30] bg-secondary-black pl-4 pr-4 rounded-3xl ">
                        <div className="text-center pt-2">
                            <h2 className={'text-3xl mt-4 font-semibold'}>Публічна оферта
                            </h2>
                        </div>

                        {/*<h2 className={'text-2xl mt-4'}>ФОП Коструба Тарас Миколайович (надалі «Виконавець»), який діє на підставі виписки з ЄДР  з однієї сторони, цим документом пропонує необмеженому колу фізичних осіб, надалі - Клієнт або	Замовник, з іншої Сторони (надалі	разом	- Сторони) – акцептувати цю Публічну оферту (укласти договір про надання  інформаційних  послуг з використання  програмної продукції ISP Network LTD).*/}
                        {/*    Оферта є публічною	і, згідно ст. ст. 633, 641 ЦК України, її умови однакові для всіх Клієнтів або Замовників. Беззастережне прийняття всіх умов даної Публічної оферти без будь-яких винятків і/або обмежень вважається акцептом даної Публічної оферти (далі Договору) Виконавцем і Замовником, а сам Договір автоматично вважається укладеним.*/}
                        {/*</h2>*/}

                        <h3 className={'text-xl mt-2 font-medium'}>Розділ І. Основні поняття</h3>
                        <p className={'z-20 text-xl'}>Публічний договір (далі просто Договір ) укладається між Виконавцем з одного боку та Користувачам, з іншого боку. Договір укладається на надання інформаційних послуг Виконавцем .
                        </p>
                        <p className={'text-xl '}>Сайт – (надалі просто сайт) інтернет-сайт, розташований за адресою
                            <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                 https://maximum-ott.com/
                                </Link><br/>
                            </a>
                        </p>
                        <p className={'text-xl'}>Сайт є інформаційною інтернет платформою, розміщеною в мережі інтернет
                        </p>
                        <p className={'text-xl'}>Виконавець – сайт
                            <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
                        </p>
                        <p className={'text-xl'}>Адміністрація сайту – представники Виконавця , що модерують сайт
                        </p>
                        <p className={'text-xl'}>Користувач – будь-яка фізична чи юридична особа, яка користується послугами сайту та прийняла умови цього договору
                        </p>
                        <p className={'text-xl'}>Рекламодавець – будь-яка фізична чи юридична особа, яка користується послугами сайту та прийняла умови цього договору
                        </p>
                        <p className={'text-xl'}>Клієнт – користувач, або будь-яка інша особа, яка користується послугами сайту
                        </p>
                        <p className={'text-xl'}>Користування сайтом можливе тільки після повного, без застережень і будь-яких винятків, прийняття умов даного публічного договору
                        </p>
                        <p className={'text-xl'}>У випадку, якщо користувач не згоден з умовами даного договору, він повинен негайно залишити будь-яку сторінку даного сайту
                            <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                    https://maximum-ott.com/
                                </Link><br/>
                            </a>
                        </p>
                        <p className={'text-xl'}>До того як сторони дійдуть згоди щодо узгодження рішення пункту договору, що викликає у користувача розбіжності з адміністрацією сайту, даному користувачеві користуватися послугами сайту заборонено
                        </p>
                        <p className={'text-xl'}>Оголошення – це будь-яка інформація, яка не суперечить законодавству.
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Персональні дані – будь-яка інформація, що відноситься прямо чи опосередковано до певної чи визначеної фізичної чи юридичної особи (суб'єкта персональних даних), за якими ця особа може бути конкретно ідентифікована
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Перед використанням сайту користувач зобов'язаний здійснити реєстрацію.
                        </p>
                        <p className={'text-xl'}>Реєстрація – заповнення реєстраційної на сайті спеціальної реєстраційної форми, яка дозволяє конкретно ідентифікувати користувача.
                        </p>
                        <p className={'text-xl'}>Особистий кабінет – електронний кабінет Користувача , за допомогою якого він може керувати своїми налаштуваннями.
                        </p>
                        <p className={'text-xl'}>Достовірна інформація – це відомості та дані, які надає Користувач або Рекламодавець, та яка відповідає дійсності.
                        </p>

                        <h3 className={'text-xl mt-4 font-medium'}>Розділ ІІ. Загальні положення</h3>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Користувач зобов'язаний перед початком роботи ознайомитися з цим договором та прийняти його.
                        </p>
                        <p className={'text-xl'}>Якщо Клієнт частково, або повністю не згоден з цими умовами даного публічного договору, робота з сайтом заборонена.
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>У разі незгоди з умовами даного договору Користувач або зобов'язаний залишити сайт та не користуватись цим сервісом до усунення протиріч.
                        </p>
                        <p className={'text-xl'}>Користувач вважається таким, що прийняв умови Угоди, в повному обсязі без будь-яких застережень і винятків, як тільки він починає використовувати будь-який сервіс сайту , або, як тільки він проходить процедуру реєстрації .
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Реєстрація користувача, в обов'язковому порядку, повинна проводитись із зазначенням достовірних даних про користувача.
                        </p>
                        <p className={'text-xl'}>У разі якщо користувач, при реєстрації вказує недостовірні дані про себе, цей договір вважається неукладеним і адміністрація сайту може і залишає за собою право проводити будь-які дії стосовно даного користувача, як особа, яка не прийняла або порушила умови даного публічного договору без будь-якого повідомлення. Клієнта.
                        </p>
                        <p className={'text-xl'}>Виконавець пропонує Користувачам надання інформаційних послуг.
                        </p>
                        <p className={'text-xl'}>Виконавець кожного першого числа місяця розсилає інформацію про програми телепередач на електронну пошту клієнта.
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Елементи дизайну, текст, графічні зображення, бази даних, контент та інші об'єкти, розміщені на сайті, є об'єктами виняткових прав Виконавця
                        </p>

                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <h3 className={'text-xl mt-4 font-medium'}>Розділ III. Права та обов'язки сторін
                        </h3>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Користувач (Рекламодавець) прийнявши положення даного договору (почавши користуватися послугами сайту ) приймає на себе використання матеріалів сайту без обмежень та винятків та підтверджує свою згоду, що він використовує сайт на свій страх та ризик і самостійно бере на себе всі ризики, пов'язані з використанням розміщених на сайті матеріалів.
                        </p>
                        <p className={'text-xl'}>Виконавець не несе жодної відповідальності за будь-які (фінансові, моральні та інші) збитки та втрати, отримані Користувачем (Рекламодавцем) внаслідок використання інформації взятої зі сторінок сайту або перейшовши за посиланнями, розміщеними на сторінках сайту .
                        </p>
                        <p className={'text-xl'}>Виконавець ніколи не є учасником угоди між Користувачем та Рекламодавцем . Усі угоди між Користувачем та Рекламодавцем відбуваються без участі, і будь-яких гарантій з боку Виконавця або адміністрації сайту як третьої особи.
                        </p>
                        <p className={'text-xl'}>Виконавець не перевіряє і не несе відповідальності за походження та якість товарів та послуг, а також достовірність відомостей про рекламовані товари та послуги.
                        </p>
                        <p className={'text-xl'}>Якщо у Користувача (Рекламодавця) в результаті роботи з сайтом виникають претензії матеріального або нематеріального характеру до іншого Користувача (Рекламодавця) , то згідно з умовами даного договору всі питання, у тому числі судового характеру, вирішуються Користувачем (Рекламодавцем) самостійно, без участі представників Виконавця або адміністрації сайту .
                        </p>
                       {/*// <p className={'text-xl'}>Щоб Виконавець мав право публікувати відомості, отримані від Користувача , Користувач надає Виконавцю не ексклюзивне, загальносвітове, безмитне, безстрокове, безвідкличне, субліцензоване та передане право на використання інформації (публікації, демонстрації, збору тощо), наданої за власною ініціативою, будь-яких законних цілях і без обмеження чи вказівки авторства. Перелічені вище права надаються Виконавцю безоплатно та безстроково. Користувач зберігає всі права власності на інформацію, що розміщується. .Користувач надає право доступу до розміщеної ним інформації всім користувачам Сайту*/}
                       {/* </p>*/}
                       {/* <p className={'text-xl'}>Якщо Користувач розміщує оголошення із зображеннями без знака охорони авторського права на сайті – він погоджується з тим, що зображення та/або його частини будуть використані на користь Виконавця без виплати винагороди.*/}
                       {/* </p>*/}
                       {/* /!* eslint-disable-next-line react/no-unescaped-entities *!/*/}
                       {/* <p className={'text-xl'}>Якщо третя особа вважає, що її авторські права порушені, то вона зобов'язана звернутися до адміністрації сайту , з наданням документів, що підтверджують авторські права на предмет претензії. Адміністрація сайту після отримання претензії та розгляду претензії по суті зобов'язується в найкоротші терміни видалити контент, що порушує авторські права третьої особи.*/}
                       {/* </p>*/}
                       {/* <p className={'text-xl'}>Якщо спори про авторське право виникають між Користувачами (Рекламодавцями) , то у цьому випадку всі питання авторського права вирішуються Користувачами (Рекламодавцями) у судовому чи не судовому порядку без участі представників Виконавця або адміністрації сайту самостійно. Вся відповідальність за порушення авторського права повністю лежить на Користувачі (Рекламодавці), що розмістив інформацію, що порушує авторське право третьої особи.*/}
                       {/* </p>*/}
                        <p className={'text-xl'}>Жоден пункт у цьому договорі не може бути витлумачений як спільна діяльність між Виконавцем (адміністрацією сайту) та Користувачем (Рекламодавцем) .
                        </p>
                        <p className={'text-xl'}>Виконавець не несе жодної відповідальності у разі утрудненого, частково або повністю відсутнього доступу до даних сайту через непередбачені обставини непереборної сили або форс-мажорні обставини.
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Виконавець та адміністрація сайту мають право зв'язуватися з Користувачем (Рекламодавцем) через електронну пошту, мобільний телефон, зазначений при реєстрації .
                        </p>
                        <p className={'text-xl'}>Виконавець має право використовувати дані останнього доступу Користувача (Рекламодавця) до системи для збору статистики.
                        </p>
                        <p className={'text-xl'}>Виконавець використовує файли cookie як для спрощення користування сайтом, так і для збору статистики.
                        </p>

                        <h3 className={'text-xl mt-4 font-medium'}>Розділ IV. Оплата послуг</h3>
                        <p className={'text-xl'}>Замовлення платних послуг здійснюється Користувачем або Рекламодавцем  в особистому кабінеті або будь-яких інших відповідних розділах сайту .
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>Перед тим, як замовляти платні послуги Користувач / Рекламодавець) зобов'язується ознайомитися з цінами.
                        </p>
                        <p className={'text-xl'}>Виконавець може повернути сплачені кошти за не надані послуги у таких випадках:
                        </p>
                        <p className={'text-lg ml-10'}>Якщо Користувач / Рекламодавець, порушивши умови договору, продублював облікові записи, і оплата була виконана з віддаленою адміністрацією сайту облікового запису (повернення коштів здійснюється виключно після звернення Користувача / Рекламодавця на активний обліковий запис Користувача / Рекламодавця );
                        </p>
                        <p className={'text-lg ml-10'}>Якщо оплату було здійснено при публікації оголошення про заборонені товари або послуги, зазначені цим договором та чинним законодавством – кошти не повертаються.
                        </p>
                        <p className={'text-lg ml-10'}>Адміністрація сайту має право відмовити у поверненні коштів у разі якщо Користувач / Рекламодавець порушує умови договору .
                        </p>

                        <h3 className={'text-xl mt-4 font-medium'}>Розділ V. Права та обов’язки сторін</h3>
                        <p className={'text-xl'}>Цей договір набирає чинності з моменту початку використання сайту або реєстрації на сайті та діє безстроково до моменту розірвання договору однієї із сторін.
                        </p>
                        <p className={'text-xl'}>Користувач / Рекламодавець має право в односторонньому порядку без повідомлення та пояснення причин розірвати дію договору та припинити свою реєстрацію на сайті Виконавця .
                        </p>
                        <p className={'text-xl'}>Виконавець має право в односторонньому порядку без повідомлення Користувача / Рекламодавця та пояснення причин розірвати дію договору та припинити його реєстрацію на сайті Виконавця.
                        </p>
                        <p className={'text-xl'}>Цей договір може бути змінений Виконавцем в односторонньому порядку без спеціального повідомлення Користувача / Рекламодавця . Договір із змінами набирає чинності з моменту його розміщення на Сайті Виконавця за адресою
                            <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
                        </p>
                        <p className={'text-xl'}>З моменту розміщення нового договору на сайті виконавця старий договір автоматично втрачає чинність.
                        </p>
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        <p className={'text-xl'}>У разі розбіжностей за цим договором між Виконавцем та Користувачем / Рекламодавцем сторони зобов'язуються вирішувати їх шляхом переговорів. Якщо будь-які суперечки або розбіжності щодо даного договору , не можуть бути вирішені шляхом переговорів – то вони будуть розглядатися в судовому порядку відповідно до чинного законодавства.
                        </p>
                        <p className={'text-xl pb-10'}>Якщо будь-який пункт цього договору буде визнаний судом недійсним – це не поширюватиметься на інші пункти цього договору .
                        </p>

                        {/*<h3 className={'text-xl mt-4 font-medium'}>Розділ VI. Інші умови</h3>*/}

                        {/*<h3 className={'text-xl mt-4 font-medium'}>Розділ VII. Відповідальність сторін</h3>*/}

                        {/*<h3 className={'text-xl mt-4 font-medium'}>Розділ VIII. Термін дії договору</h3>*/}

                        {/*<h3 className={'text-xl font-medium'}>Розділ IX. Заключні положення.</h3>*/}


                        {/*<div className="flex lg:justify-evenly flex-col lg:flex-row">*/}
                        {/*    <div>*/}
                        {/*        <h2 className={'text-2xl mt-4'}>Замовник:</h2>*/}
                        {/*    </div>*/}

                        {/*    <div>*/}
                        {/*        <h2 className={'text-2xl mt-4'}>Виконавець:</h2>*/}
                        {/*    </div>*/}
                        {/*</div>*/}
                        {/*<div className="flex lg:justify-around">*/}
                        {/*    <div>*/}
                        {/*        <h2 className={'text-2xl mt-4'}></h2>*/}
                        {/*    </div>*/}

                        {/*    <div className="pb-8">*/}
                        {/*        <h2 className={'text-2xl mt-4'}>ФОП Коструба Тарас Миколайович</h2>*/}
                        {/*    </div>*/}
                        {/*</div>*/}

                    </div>
                </div>
            </div>
        </div>
    )
}