import {useState} from "react";
import Link from "next/link";
import Button from "../../comps/Button";
import {useDispatch} from "react-redux";
import {setPolicy} from "../../storage/reducers/signReducer";
import {useRouter} from "next/router";

export default function Policy() {
    const [read, setRead] = useState(false)
    const router = useRouter()
    const dispatch = useDispatch()
    return (
        <div className="h-full bg-gradient-to-t from-grad_from to-grad_to ">
        <div className={'font-[Inter] text-gray-200 items-center justify-center w-full'}>
            <div className='container min-h-screen mx-auto pt-6 pb-4 '>
                <div className="bg-gray-800 pl-4 pr-4 rounded-3xl ">
                    <div className="text-center pt-2">
                        <h2 className={'text-3xl mt-4'}>Політика конфіденційності сайту</h2>
                    </div>


                    <h2 className={'text-2xl mt-4'}>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ ТА ЗАХИСТУ ПЕРСОНАЛЬНИХ ДАНИХ</h2>

                    <h3 className={'text-xl mt-2 font-medium'}>Розділ І. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h3>
                    <p className={'text-xl'}>1.1. Ця Політика конфіденційності надає Користувачеві інформацію про обробку його персональних даних адміністратором— Адміністратор , у тому числі інформацію, що вимагається статтями 13 та 14 Регламенту 2016/679 («GDPR») про захист фізичних осіб щодо обробки персональних даних (далі — «GDPR»).
                    </p>
                    <p className={'text-xl'}>1.2. Уважно ознайомтеся з Політикою конфіденційності перед тим, як використовувати сайт
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 , оскільки під час використання сайту здійснюється збирання, обробка, використання та зберігання персональних даних, а також передача персональних даних третім особам (у тому числі транскордонна передача даних).
                    </p>
                    <p className={'text-xl'}>1.3. Ця Політика конфіденційності (далі — «Політика») є невід’ємною частиною публічної оферти (далі — «Угода») між Адміністратором та Користувачами, розміщеною за посиланням      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                    </p>
                    <p className={'text-xl'}>1.4. Контролером персональних даних Користувачів є Адміністратор сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                    </p>
                    <p className={'text-xl'}>1.5. З усіх питань щодо обробки (включаючи збір, використання та зберігання) персональних даних, а також передачі персональних даних Користувачі можуть звертатися за адресою на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ ІІ. ЩО ТАКЕ ПЕРСОНАЛЬНІ ДАНІ?</h3>
                    <p className={'text-xl'}>2.1. Персональні дані (далі — «Дані») — означають будь-яку інформацію щодо Користувача, яка дозволяє ідентифікувати Користувача прямо або опосередковано, наприклад, ім’я, ідентифікатор користувача і (user ID), інформація про місцезнаходження, онлайн-ідентифікатори (показники дій Користувача), або інша інформація щодо Користувача.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ ІІІ. ЯКІ ДАНІ КОРИСТУВАЧА ОБРОБЛЯЄ АДМІНІСТРАТОР?</h3>
                    <p className={'text-xl'}>Адміністратор може обробляти різні категорії Даних Користувача, а саме:
                    </p>
                    <p className={'text-xl'}>3.1. Дані, надані Користувачем:
                    </p>
                    <p className={'text-xl'}>3.1.1. Ім’я та прізвище Користувача, псевдонім (нікнейм), адреса електронної пошти, номер телефону, стать, вік, фото (аватар), платіжні дані та дані про способи оплати. Такі дані Ви надаєте декількома способами, наприклад, під час реєстрації та/або використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 , взаємодії зі службою підтримки та/або участі в промо-активностях, які проводяться Адміністратором (як самостійно, так і за допомогою партнерів).
                    </p>
                    <p className={'text-xl'}>3.1.2. Інформація, що надається під час публікації відгуку та/або проставлення позначки «Подобається»/«Не подобається» про окрему одиницю Контенту та/або іншу інформацію, яку Ви надаєте під час використання Сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
.
                    </p>
                    <p className={'text-xl'}>3.2. Дані, збирання яких здійснюється Адміністратором, у тому числі за допомогою файлів cookies:
                    </p>
                    <p className={'text-xl'}>3.2.1. Дані про активність Користувача на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 , такі як історія переглядів, історія пошуку та інше.
                    </p>
                    <p className={'text-xl'}>3.2.2. Дані про вид пристрою, модель, id пристрою та його операційну систему, за допомогою якого здійснюється доступ до сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
; інтернет-браузер, з якого здійснюється вхід до сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 . У разі використання програмних продуктів сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  на пристроях для здійснення доступу до сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  збираються дані про місцезнаходження пристрою (аж до міста).
                    </p>
                    <p className={'text-xl'}>3.2.3. Деталі взаємодії зі службою підтримки, такі як дата, час та причина звернення, стенограма будь-якої розмови зі співробітниками служби підтримки, номер телефону, з якого здійснювався дзвінок до служби підтримки та запис такої розмови.
                    </p>
                    <p className={'text-xl'}>3.2.4. Дані, які ми отримуємо за допомогою cookies, веб маяків та інших подібних технологій.
                    </p>
                    <p className={'text-xl'}>3.2.5. Результати рекламних активностей.
                    </p>
                    <p className={'text-xl'}>3.3. Дані з інших джерел:
                    </p>
                    <p className={'text-xl'}>3.3.1. У разі реєстрації на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 і за допомогою облікового запису Користувача в соціальних мережах (перелік соціальних мереж, обліковий запис яких дозволяє здійснити реєстрацію на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, вказаний на сторінці реєстрації Користувача) Користувач дає згоду на передачу Даних, необхідних для реєстрації облікового запису на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 (таких як ім’я, прізвище, адреса електронної пошти, фото (аватар), ідентифікатор користувача в соціальній мережі (user ID), дата народження, від власника такої соціальної мережі до Адміністратора.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ IV. ЗА ЯКИХ УМОВ АДМІНІСТРАТОР МОЖЕ ОБРОБЛЯТИ ДАНІ ДІТЕЙ?</h3>
                    <p className={'text-xl'}>4.1. Наші послуги можуть використовуватись дітьми виключно під контролем батьків або іншого законного опікуна. Користувачеві має бути не менше 18 років, щоби використовувати сайт      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 самостійно.
                    </p>
                    <p className={'text-xl'}>4.2. Користувач повинен бути достатньо дорослим, щоб ухвалити рішення про надання своїх Даних Адміністратору. Якщо Користувач не досяг 14 років, згоду на обробку його даних має надати або схвалити один із його батьків, опікун чи інший законний представник.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ V. НА ЯКИХ ПІДСТАВАХ АДМІНІСТРАТОР ОБРОБЛЯЄ ДАНІ? З ЯКОЮ МЕТОЮ АДМІНІСТРАТОР ОБРОБЛЯЄ ДАНІ?</h3>
                    <p className={'text-xl'}>5.1. Правовими підставами обробки персональних даних є:
                    </p>
                    <p className={'text-xl'}>5.1.1. Правовими підставами обробки персональних даних є: 5.1.1. обробка з метою надання, аналізу, адміністрування, вдосконалення та персоналізації на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, тобто для виконання Угоди користувача, однією зі сторін якої є Користувач, а також щодо кроків, що передують укладенню угоди, і здійснення реєстрації Користувачів на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 і, для отримання платежів від Користувачів і спілкування з Користувачами щодо вищезазначеного (ст. 6 (1) (b) GDPR).
                        Ось кілька прикладів:
                        - Ідентифікація Користувачів під час використання  сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
. Адміністратор може використовувати інформацію для підтвердження доступу Користувача на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
.
                        - Індивідуалізація використання Користувачем Сервісу, виходячи з моделі поведінки та сфери інтересів Користувача. Адміністратор може здійснювати профілювання персональних даних для підвищення рівня їх актуальності. Профілювання – будь-яка форма автоматизованої обробки персональних даних, у тому числі використання персональних даних для оцінки певних особистих характеристик особи, зокрема для аналізу чи прогнозування аспектів, пов’язаних із цією особою в контексті її діяльності. Під час користування  сайтом       <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 такі як особисті переваги, інтереси та місцезнаходження. Адміністратор не приймає жодних рішень, які можуть мати правові чи інші важливі наслідки для Користувача, в тому числі на основі профілювання даних. Можлива обробка в автоматичному режимі, включаючи профілювання, буде призначена виключно для аналізу та прогнозування переваг Користувача для підготовки індивідуальних пропозицій Користувачеві.
                        - Забезпечення надсилання важливих повідомлень, таких як зміни в Угоді користувача та/або Політиці конфіденційності.
                    </p>
                    <p className={'text-xl'}>5.1.2. згода Користувача на обробку персональних даних (ст. 6 (1) (a) GDPR);
                        Ось кілька прикладів:
                        - Використання персональних даних для підвищення релевантності рекламних матеріалів і більш точного таргетингу.
                        - Ми використовуємо файли cookie та подібні технології, щоб забезпечити контент і найкращу взаємодію з користувачем через пристрій користувача. Для отримання додаткової інформації перегляньте розділ про файли cookie та налаштування в нашому банері файлів cookie на пристрої користувача.
                    </p>
                    <p className={'text-xl'}>5.1.3. законний інтерес Адміністратора здійснювати прямий маркетинг, наприклад, надсилати листи, смс-повідомлення, повідомлення через месенджери (наприклад, Viber, Telegram тощо), push-повідомлення та інші повідомлення, зокрема в інтерфейсі на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, інформаційно-рекламного характеру, а також законні інтереси для протидії шахрайські дії, в тому числі пов’язані з тестовим періодом користування послугами на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 (ст. 6 (1) (f) GDPR).
                        Ось кілька прикладів:
                        - Аналіз та дослідження дій Користувачів в рамках сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 для підвищення якості послуг, що надаються в на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, а також способів взаємодії з Користувачами.
                        - Запобігання шахрайським діям, у тому числі з тестовим періодом використання сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
.
                        - Якщо Користувач бере участь у будь-якій рекламній кампанії, конкурсі чи подібному заході, Адміністратор має право використовувати інформацію, надану Користувачами, для модерації такого заходу.
                        - Адміністратор може здійснювати профілювання персональних даних для підвищення якості послуг. Адміністратор не приймає жодних рішень, які можуть мати правові чи інші важливі наслідки для Користувача, в тому числі на основі профілювання даних. Можлива обробка в автоматичному режимі, включаючи профілювання, буде призначена лише для аналізу та прогнозування переваг Користувача щодо прямого маркетингу.
                        - Інформування Користувачів про появу нової інформації в Сервісі, рекламні акції чи інші новини на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  електронною поштою, push-повідомленнями чи іншими засобами зв’язку. Користувач має право відмовитися від отримання такої інформації, самостійно вимкнувши функцію отримання розсилок, перейшовши за спеціальним посиланням, вказаним в електронному листі; відключивши push-повідомлення в налаштуваннях мобільних пристроїв; заблокувавши отримання повідомлень у додатках-месенджерах.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ VI. ЯК ДОВГО ЗБЕРІГАЮТЬСЯ ПЕРСОНАЛЬНІ ДАНІ КОРИСТУВАЧА?</h3>
                    <p className={'text-xl mt-2'}>6.1. Ми зберігаємо та обробляємо ваші дані не довше, ніж вони потрібні для досягнення цілей, задля яких вони були зібрані. Терміни зберігання визначаються індивідуально в кожному конкретному випадку та залежать від таких речей, як характер даних, чому вони збираються та обробляються, а також відповідних юридичних чи операційних потреб у зберіганні. Зверніть увагу, що ми також можемо зберігати та використовувати вашу інформацію, якщо це необхідно для дотримання юридичних зобов’язань, вирішення суперечок і забезпечення виконання наших угод.
                    </p>
                    <p className={'text-xl mt-2'}>6.2. Після закінчення терміну зберігання для обробки ваших даних ми можемо узагальнювати або видаляти дані до рівня, коли Користувача більше не можна ідентифікувати, та обробляти виключно в статистичному вигляді. Після вжитих запобіжних заходів захисту від ризиків повторної ідентифікації дані більше не вважаються персональними, оскільки вони не дозволяють ідентифікувати Користувача.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ VII. ЯКІ КОРИСТУВАЧ МАЄ ПРАВА ЩОДО ЙОГО ПЕРСОНАЛЬНИХ ДАНИХ?</h3>
                    <p className={'text-xl'}>7.1. Користувач має такі права щодо його персональних даних:
                        • вимагати від контролера доступу до даних, що до нього відносяться, їх виправлення, видалення або обмеження обробки;
                        • заперечувати проти обробки в разі, якщо така обробка здійснюється на підставі законного інтересу Адміністратора, у тому числі заперечувати проти обробки з маркетинговою метою, включно з профілюванням, пов’язаним з прямим маркетингом;
                        • отримувати дані в структурованому, широко використовуваному та машинопрочитуваному форматі, а також, якщо це технічно можливо, безперешкодно передавати їх іншому контролеру (т.зв. переносимість даних);
                        • відкликати згоду будь-коли, не впливаючи на законність обробки на основі згоди до її відкликання.
                    </p>
                    <p className={'text-xl'}>7.2. Для реалізації своїх прав Користувач може зв’язатися з Адміністратором електронною поштою — написавши листа за адресою на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                    </p>
                    <p className={'text-xl'}>7.3. У разі звернення Користувача із запитом про видалення Персональних даних Адміністратор забезпечує видалення облікового запису та персональних даних, пов’язаних із таким обліковим записом. Адміністратор залишає за собою право зберігати платіжні дані, які забезпечують захист від шахрайства при взаємодії на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 (у тому числі пов’язане з багаторазовою активацією тестового періоду послуг на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
).
                    </p>
                    <p className={'text-xl'}>7.4. Видалення персональних даних також може бути обмежене відповідно до вимог чинного законодавства. Зокрема, такі обмеження можуть передбачати обов’язок Адміністратора зберегти видалену Користувачем інформацію на строк, встановлений чинним законодавством, та передати таку інформацію відповідно до законодавчо встановленої процедури державного органу. Крім того, Адміністратор має право обмежити право на видалення з метою захисту власних інтересів від будь-яких юридичних претензій у рамках строків позовної давності. Якщо право на видалення даних обмежене, Користувач може вимагати, щоб Адміністратор обмежив обробку даних лише зберіганням.
                    </p>
                    <p className={'text-xl'}>7.5. Реалізація інших прав аналогічно може бути обмежена відповідно до вимог чинного законодавства.
                    </p>
                    <p className={'text-xl'}>7.6. Запит Користувача на здійснення перерахованих вище прав буде оцінений з урахуванням обставин окремого випадку. Звертаємо увагу, що Адміністратор може зберігати та використовувати інформацію, якщо це необхідно для дотримання юридичних зобов’язань, вирішення спорів та забезпечення виконання угод.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ VIII. ЩО ТАКЕ ФАЙЛИ COOKIE І ЯК МИ ЇХ ВИКОРИСТОВУЄМО?</h3>
                    <p className={'text-xl'}>8.1. На сайті
                            <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, мобільних додатках та рекламних оголошеннях можуть використовуватися файли cookie та інші аналогічні технології. Ці технології зберігають на пристрої Користувача ідентифікаційні текстові файли — шматочки програмного коду, які дозволяють зберігати інформацію про Користувача та ідентифікувати його при подальшому використанні на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                    </p>
                    <p className={'text-xl'}>8.2. Тут перелічені типи файлів cookie, що розміщуються на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 та третіми особами. Крім файлів cookies, суворо необхідних для надання послуг на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, вони містять інформацію про файли cookies, які можуть використовуватися третіми особами для надання допомоги Адміністратору сайту
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  в наданні послуг. За терміном дії файли cookies на сайті
                        <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 є постійними, тимчасовими або сесійними. Кількість та назви файлів cookies можуть змінюватися. Тому таблиці в налаштуваннях можуть періодично поновлюватися з метою надання Користувачеві найбільш актуальної інформації.
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        Основні файли cookies - ці файли cookies є обов'язковими для функціонування сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, і їх не можна відключити в системах на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
. Вони встановлюються у відповідь на здійснені Користувачем дії, які є запитом на надання послуг, наприклад, налаштування, реєстрація, вхід або заповнення профілю. Якщо налаштувати браузер на блокування цих файлів cookie, це призведе до того, що деякі частини на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 не працюватимуть. До таких файлів cookies на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 відносяться файли cookies функціональності, продуктивності, аналітики (наприклад, персоналізація контенту, система рекомендацій, без якої сервіс не надається; моніторинг шахрайських дій), безпеки, автентифікації профілю користувача, а також cookies файли сесій Користувача.
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        Аналітичні файли cookie - ці файли cookie збирають інформацію про те, як Користувачі використовують веб сайт, наприклад, які сторінки Користувачі найчастіше відвідують і чи отримують вони повідомлення про помилки з веб сторінок. Також ці файли cookies використовуються для надання статистичної інформації, яка зазвичай використовується для вимірювання продуктивності та покращення. Це також відоме як "аналітика". Аналітика включає такі дії, як підрахунок відвідувань сторінок, час перебування, показники, переваги. В електронних комунікаціях можуть використовуватися «URL-адреси переходу по клацанню», які пов'язані з певними матеріалами на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, і при натисканні на які Користувач переходить на цільову сторінку. У цей момент з боку Адміністратора сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 також здійснюється збір аналітичних даних, оскільки вони надають інформацію про найбільш популярні теми та рівень взаємодії з Користувачем. Іноді послуги аналітики надаються третіми сторонами та спеціалізованим програмним забезпеченням, яке може використовувати власні та сторонні файли cookies. Деякі сторонні програмні служби, вбудовані на сайт, можуть використовувати аналітичні служби для вимірювання ефективності послуг. Сайт      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 використовує Google Analytics, що дозволяє підраховувати відвідуваність та джерела трафіку, щоб вимірювати та покращувати ефективність на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
. Вони допомагають дізнатися, які сторінки є найбільш та найменш популярними, і побачити, як Користувачі переміщуються сайтом. Щоб переглянути конфіденційність файлів cookies Google Analytics, перейдіть за посиланням: https://support.google.com/analytics/answer/6004245.
                        {/* eslint-disable-next-line react/no-unescaped-entities */}
                        Цільові файли cookies - ці файли cookies використовуються для надання реклами, яка більше відповідає Користувачеві та інтересам користувача. Наприклад, інформація про перегляд певного Контенту за допомогою комп'ютера або мобільного пристрою Користувача дозволяє зробити рекламні повідомлення на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 та матеріали більш відповідними інтересам Користувача. Крім цього, спеціальні піксельні теги дозволяють визначити, чи було відкрито та прочитано надісланий сайтом      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
. Сайт      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  також може використовувати ці відомості, щоб зменшити кількість електронних листів або відмовитись від них. Також цільові файли cookies використовуються для визначення ефективності рекламної кампанії. Цільові файли cookie можуть бути встановлені на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  рекламними партнерами. Ці файли cookie пам'ятають, що Користувач відвідав конкретний веб сайт, і ця інформація передається іншим організаціям, наприклад, рекламодавцям. Якщо Користувач не дозволить ці файли cookies, то все одно бачитиме загальну рекламу, яка не базуватиметься на інтересах Користувача.
                        Файли cookies третіх сторін - ці файли cookie встановлюються третіми сторонами для маркетингових, аналітичних і функціональних цілей. Наприклад, під час авторизації через зовнішні соціальні мережі певні файли cookie можуть бути встановлені для коректної роботи функцій. Якщо такі файли cookie заблоковано, певні частини функціональних можливостей сервісу можуть працювати некоректно. Список і назва таких файлів cookie може динамічно змінюватися відповідною третьою стороною.
                        Категорія IAB мети. - Ми обробляємо ваші дані, щоб надавати контент або рекламу, і вимірюємо доставку такого контенту або реклами, щоб отримати інформацію про наш веб-сайт. Ми надаємо цю інформацію нашим партнерам на основі згоди та законного інтересу. Ви можете скористатися своїм правом надати згоду або заперечити проти законного інтересу на основі конкретної цілі або на рівні партнера за посиланням під кожною метою. Про ці варіанти буде повідомлено наших постачальників, які є участниками Transparency and Consent Framework (TCF).
                    </p>
                    <p className={'text-xl mt-2'}>8.3. Користувач завжди може обмежити використання cookies або змінити налаштування використання cookies під час використання ISP Network та відкликати свою згоду, за допомогою cookies-банера на пристрої користувача. Крім цього, для зміни налаштувань файлів cookies Користувач може скористатися налаштуваннями свого Інтернет-браузера або мобільного пристрою. Для цього рекомендуємо перейти за такими посиланнями: <br/>
                        <Link href={'https://support.microsoft.com/ru-ru/topic/%D1%83%D0%B4%D0%B0%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D1%84%D0%B0%D0%B9%D0%BB%D0%BE%D0%B2-cookie-%D0%B8-%D1%83%D0%BF%D1%80%D0%B0%D0%B2%D0%BB%D0%B5%D0%BD%D0%B8%D0%B5-%D0%B8%D0%BC%D0%B8-168dab11-0753-043d-7c16-ede5947fc64d'} >
                        • Для користувачів Internet Explorer;
                        </Link><br/>
                        <Link href={'https://support.google.com/chrome/answer/95647?hl=ru&ref_topic=14666'} >
                        • Для користувачів Chrome;
                        </Link><br/>
                        <Link href={'https://support.apple.com/ru-ru/guide/safari/sfri11471/mac'} >
                        • Для користувачів Safari web та Safari на iPhone, iPad та iPod touch;
                        </Link><br/>
                        <Link href={'https://support.mozilla.org/ru/kb/kuki-informaciya-kotoruyu-veb-sajty-hranyat-na-vas?redirectslug=Cookies&redirectlocale=en-US'} >
                        • Для користувачів Firefox;
                        </Link><br/>
                        <Link href={'https://support.google.com/accounts/answer/32050?co=GENIE.Platform%3DAndroid&hl=ru'} >
                        • Для користувачів Android;
                        </Link><br/>
                    </p>
                    <br/>

                    <h3 className={'text-xl font-medium'}>Розділ IX. ЩО ТАКЕ ФАЙЛИ COOKIE І ЯК МИ ЇХ ВИКОРИСТОВУЄМО?</h3>
                    <p className={'text-xl'}>9.1. Для належного та якісного надання послуг Користувачеві, підтримки різних функцій на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 у та забезпечення його роботи, для надання маркетингових та рекламних послуг або для здійснення транзакцій за банківськими картками або іншими способами оплати на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 ми укладаємо угоди з незалежними підрядниками, а також співпрацюємо з іншими постачальниками послуг, компаніями та організаціями. У рамках цього залучення підрядників та постачальників послуг може здійснюватись передача даних Користувача третім особам.
                    </p>
                    <p className={'text-xl'}>9.2. У випадках, коли дані передаються третій особі, розташованій у країні, яка не забезпечує адекватного рівня захисту даних у розумінні законодавства Європейського Союзу, Адміністратор вживає додаткових заходів щодо захисту даних Користувача, наприклад, укладає договори щодо обробки даних на основі прийнятих положень про захист даних, затверджених Європейською Комісією.
                    </p>
                    <p className={'text-xl'}>9.3. Серед іншого ми залучаємо компанії-партнерів (далі — «Партнери») з метою надання доступу до сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, для здійснення технічної підтримки Користувачів та прийняття рішень щодо покращення обслуговування Користувачів.
                        Адміністратор надає послуги на сайті      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 на території будь яких країн світу. Послуги надання доступу до сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 в усіх країнах можуть надаватися Користувачеві компаніями, онлайн- сервіси яких функціонують під доменними іменами, що містять позначення без обмежень рівнів ієрархії таких веб сайтів, а також програмних додатків).
                        За такої умови спрацює автоматична переадресація Користувача на відповідний сайт і Користувач не має необхідності проводити додаткову реєстрацію у вказаному онлайн-сервісі, що дає змогу заощадити час Користувачів та полегшити Користувачам доступ до таких онлайн-сервісів. Інформація про вказані компанії буде повідомлена Користувачеві до початку використання Користувачем послуг такого онлайн-сервісу за допомогою інтерфейсу користувача. Адміністратор сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 , у зв’язку з його роллю, — надає послуги на території країн усього світу, де такий сервіс доступний.
                        Ролі Адміністратор сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 як спільного контролера:
                        • надання Користувачеві можливості користування сайтом під час перебування в інших країнах без необхідності проходження додаткової реєстрації, комунікація з користувачами у зв’язку з використанням сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
.
                        • інформаційні послуги, необхідні для прийняття рішень щодо покращення обслуговування Користувачів;
                        • організація, використання та надання послуг сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, у тому числі за допомогою власного програмного забезпечення, баз даних, систем;
                        • наповнення сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 інформацією;
                        • прийом платежів Користувачів;
                        • реклама;
                        • прямий маркетинг;
                        • залучення підрядників для належного та якісного надання послуг Користувачеві, підтримки різних функцій сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>

                        • партнерство з компаніями, що надають послуги сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, у тому числі з використанням сайтів та програмних додатків із доменним ім’ям, на території інших країн. Спільні контролери діють на підставі договору та вживають усіх необхідних заходів для забезпечення захисту та збереження даних Користувачів.
                    </p>
                    <p className={'text-xl'}>9.4. Інші треті особи можуть також залучатися Адміністратором, наприклад, для надання маркетингових та рекламних послуг або для здійснення транзакцій за банківськими картками чи іншими способами оплати в рамках сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
. Перелік цих третіх осіб надається Адміністратором на письмовий запит Користувача.
                    </p>
                    <p className={'text-xl'}>9.5. Зокрема, але не обмежуючись цим, Адміністратор може використовувати:
                    </p>
                    <p className={'text-xl'}>9.5.1. послуги дата-центру, який обробляє дані виключно в зашифрованому вигляді та гарантує конфіденційність цих даних;
                    </p>
                    <p className={'text-xl'}>9.5.2. послуги хмарної платформи для SaaS-рішень (SaaS — програмне забезпечення як послуга);
                    </p>
                    <p className={'text-xl'}>9.5.3. послуги постачальника мережі доставки контенту (CDN) Мережа доставки контенту дозволяє значно прискорити завантаження контенту на пристрої Користувача;
                    </p>
                    <p className={'text-xl'}>9.5.4. послуги інших постачальників інформаційно-консультаційних послуг;
                    </p>
                    <p className={'text-xl'}>9.5.5. послуги компаній для проведення аналізу та статистичних досліджень використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 з метою покращення якості послуг та роботи сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, а також таргетування (персоналізація показу) рекламних матеріалів та системи рекомендацій контенту та надання Користувачеві персоналізованих та рекомендаційних сервісів сайту;
                    </p>
                    <p className={'text-xl'}>9.5.6. послуги компаній для зв’язку з Користувачем, у тому числі напрямки повідомлень, запитів та інформації щодо використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
, а також обробки запитів та заявок від Користувача.
                    </p>
                    <p className={'text-xl'}>9.6. Зверніть увагу, що в разі надсилання повідомлення Адміністратору на його офіційні сторінки та акаунти в таких сервісах та програмах як Facebook, Instagram, Telegram, Viber, iMessages або ж надсилання листа на електронну пошту Адміністратора, ви самостійно й на свій ризик використовуєте послуги вказаних сервісів та /або послуги вашого оператора електронної пошти та погоджуєтесь із тим, що постачальники цих послуг можуть отримувати доступ до ваших персональних даних та бути незалежними контролерами ваших даних поряд з Адміністратором. Адміністратор не контролює використання персональних даних, переліченими в цьому пункті постачальниками послуг.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ X. ІНШІ ВИПАДКИ РОЗГОЛОШЕННЯ ДАНИХ</h3>
                    <p className={'text-xl'}>10.1. Розголошення персональних даних може також здійснюватись у таких випадках:
                    </p>
                    <p className={'text-xl'}>10.1.1. Розголошення інформації згідно з приписом компетентного суду або контролюючого органу у випадках, передбачених законом.
                    </p>
                    <p className={'text-xl'}>10.1.2. За наявності згоди Користувача про таке розголошення.
                    </p>
                    <p className={'text-xl'}>10.1.3. У разі проведення спільної промо-активності із третіми особами. У цьому випадку Користувач, беручи участь у такій промо- активності, надає свої персональні дані не лише Адміністратору, а й партнерам Адміністратора щодо такої активності. Звертаємо вашу увагу, що треті сторони, задіяні в проведенні промо-активностей, мають свою політику конфіденційності та взаємодії з персональними даними Користувачів та несуть відповідальність самостійно за її дотримання.
                    </p>
                    <p className={'text-xl'}>10.1.4. У разі проведення реорганізації, реструктуризації, злиття, продажу або іншої передачі активів персональні дані можуть стати частиною інформації, що передається. У разі такої передачі сторона зобов’язується забезпечувати рівень захисту персональних даних не менше, ніж це передбачено цією Політикою Конфіденційності.
                    </p>
                    <p className={'text-xl'}>10.2. Також звертаємо вашу увагу, що під час використаннясайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 Користувач може розголошувати інформацію про себе та/або щодо використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  шляхом використання плагінів «поділитися в» для деяких соціальних платформ (Facebook, Twitter умови використання таких кнопок та плагінів є безпосередньо предметом політики конфіденційності соціальних платформ).
                    </p>
                    <p className={'text-xl'}>10.3. Такі дані, вказані Користувачем у профілі, як ім’я, фото, а також будь-яку соціальну дію (наприклад, коментування) у рамках сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 будуть доступні у вільному доступі. Це означає, що їх також можуть переглядати інші користувачі в межах або поза (наприклад, користувачі, відвідувачі сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 або користувачі сторонніх пошукових систем).
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ XI. КОЛИ АДМІНІСТРАТОР МОЖЕ ЗМІНЮВАТИ УМОВИ ЦІЄЇ ПОЛІТИКИ?</h3>
                    <p className={'text-xl'}>11.1. Адміністратор залишає за собою право змінювати цю Політику. У разі зміни змісту Політики Адміністратор доводить до відома користувача переглянуту Політику. У разі внесення змін, які змінюють права Адміністратора на використання раніше зібраної інформації, Адміністратор зі свого боку вимагає від Користувача згоди щодо такого використання, якщо інше не передбачено чинним законодавством. У будь-якому випадку Адміністратор повідомляє Користувача про такі зміни.
                    </p>
                    <p className={'text-xl'}>11.2. Адміністратор зобов’язується своєчасно повідомляти про зміни в Політиці та дату набрання таких змін належним чином. Користувач може продовжувати використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
  лише після надання належної згоди з такими змінами, належною згодою з такими змінами є продовження використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 після отримання повідомлення про зміни. Якщо Користувач не приймає жодних доповнень до Політики Конфіденційності, Користувач відповідно відмовляється від використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 й зобов’язаний звернутися до Адміністратора для видалення свого облікового запису.
                    </p>

                    <h3 className={'text-xl mt-4 font-medium'}>Розділ XII. ЯК АДМІНІСТРАТОР ЗАХИЩАЄ ОСОБИСТІ ДАНІ?</h3>
                    <p className={'text-xl'}>12.1. Адміністратор реалізує всі необхідні заходи безпеки, необхідні для захисту персональних даних Користувача, наприклад:
                        • ми надаємо доступ до даних обмеженого кола осіб і лише в разі потреби;
                        • ми використовуємо безпечний протокол Hypertext Transfer Protocol Secure (HTTPS), щоби використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 через Інтернет було безпечним;
                        • ми навчаємо наш персонал безпечної обробки даних. Зокрема, ми вимагаємо від наших працівників та підрядників використовувати надійні паролі та включати багатофакторну автентифікацію;
                        • ми укладаємо з нашими співробітниками та субпідрядниками угоди про нерозголошення та обробку даних;
                        • для захисту від несанкціонованого доступу до даних ми застосували мережевий екран (брандмауер), хешування паролів Користувачів тощо;
                        • ми також регулярно створюємо резервні копії даних, щоби мати можливість відновити їх, коли це буде потрібно.
                    </p>
                    <p className={'text-xl'}>12.2. Тим не менш, Адміністратор не може гарантувати 100 % безпеки всієї інформації, яка передається та/або збирається безпосередньо Адміністратором за час використання сайту      <a className={'hover:text-gray-400 transition-all duration-300 ml-2'}>
                                <Link href={'https://maximum-ott.com/'} >
                                https://maximum-ott.com/
                                </Link><br/>
                            </a>
 , оскільки жоден спосіб передачі через Інтернет не є повністю безпечним. Адміністратор не надає гарантії, що дані не будуть переглянуті, розкриті чи знищені внаслідок відмови чи подолання будь- яких заходів захисту, вжитих Адміністратором.
                    </p>



                    {/***<div className="text-end">

                        <h2 className={'text-2xl mt-4'}>09.07.2019</h2>
                    </div>***/}

                    <div className={'flex mb-6 mt-6'}>
                        {/* <input type="checkbox" className={'w-16'} id={'read'} checked={read} onChange={(e) => {
                            setRead(e.target.checked)
                        }}/>
                        <span className="text-xl">Я прочел все условия</span> */}

                    </div>
                    {/* <button disabled={!read} className="bg-dead_violet mb-5 rounded-3xl p-3 text-lg font-medium" onClick={() => {
                        dispatch(setPolicy(read))
                        router.push('/auth/signup')
                    }}>
                        Подтвердить
                    </button> */}
                </div>
            </div>
        </div>
        </div>
    )
}